import React from 'react';
import './About.css';

function About() {
  return (
    <section className="about-section" id="about">
      <div className="about-container">
        
        {/* Introduction */}
        <div className="about-header">
          <span className="subtitle">Нашата история</span>
          <h2>Повече от мед. <br /> Това е наследство.</h2>
          <div className="gold-divider"></div>
        </div>

        {/* History and Images */}
        <div className="story-grid">
          
          {/* Tekst - Right */}
          <div className="story-text">
            <h3>Как започна всичко?</h3>
            {/* History */}
            <p> 
            Пчеларската традиция в нашето семейство започва с моя прадядо, роден през 1908 г. През 1944 г., в трудни времена, той поставя 
            основите на семейното пчеларство, започвайки с два кошера, които пренася на гръб. От двете страни на рода, пчеларството винаги 
            е било част от поминъка и връзката с природата. Моят дядо продължава делото на баща си, разширявайки стопанството и
            внедрявайки нови методи за работа с пчелите. В годините след това моят баца запазва традицията, въпреки промените в 
            икономиката и трудностите, пред които се изправя пчеларството. През поколенията е имало и ръстове, и спадове – периоди
            на силни добиви и години, в които трудът едва се е отплащал. Пчеларството никога не е прекъсвало да бъде част от нашия род.
            Днес аз съм четвъртото поколение пчелар. Продължавам това наследство с уважение към труда на предците си и с желание да 
            съхраня пчеларската традиция за следващите поколения.
            </p>
            <p>
              Днес ние не просто добиваме мед. Ние съхраняваме една традиция, която изчезва.
              Всяко бурканче е запечатало аромата на нашите планини и труда на нашите ръце.
            </p>

            <div className="quote-box">
              "Ние не сме фабрика. Ние сме пазители на природата."
            </div>
          </div>


          
        </div>

        <div className="about-footer">
            <p>От нашето семейство за вашето здраве.</p> 
        </div>

      </div>
    </section>
  );
}

export default About;